app/controllers/posts_controller.rb

  def create
    @post = Post.new(title: params[:title], body: params[:body])
    @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "afafs"], ["body", "asfsf"], ["created_at", "2016-02-08 05:21:53.669929"], ["updated_at", "2016-02-08 05:21:53.669929"]]